#+title: Bayesian statistics
#+subtitle: Data reading and regression, lecture 4/1
#+author: Nicky van Foreest
#+date: \today


#+STARTUP: overview
#+OPTIONS:  toc:1 H:2

# +include: preamble_presentation.org
#+include: preamble_handout.org


** Implementation, load data and solve for $\beta$.

Let's do some analysis on song popularity on spotify. I downloaded this data set: [[https://www.kaggle.com/yamaerenay/spotify-dataset-19212020-160k-tracks]].

#+begin_src python :session :results output :exports both
df = pd.read_csv("data_by_year_o.csv")
# print(df.head())  # use this to get an idea of  data

X = df[["tempo"]].values
Y = df["popularity"].values

beta = solve(X.T @ X, X.T @ Y)
print(beta)
#+end_src

#+RESULTS:
: [0.24267508]

Don't build this  ~solve~ function yourself.

Remark. If you want to read multiple columns into $X$, you need a list, like this:
#+begin_src python :results none :exports code
X = df[["tempo", "year"]].values

# the following gives an error
# X = df["tempo", "year"].values
#+end_src
For $Y$ I need just one column, hence I don't need a list around "popularity".


